# Task 4.9_Part 1: Intro to Data Visualization with Python

#### by Claudia Lan Yee Chiu

### Import analysis libraries

In [1]:
# Importing libraries
import pandas as pd
import numpy as np
import os

### 3. Import new customer data set as a dataframe

In [2]:
# Assign path
path = r'C:\Users\clany\OneDrive\Documents\CareerFoundry\Chap_4_Pythons Fundamentals for Data Analysts\Instacart Basket Analysis'

In [4]:
# Importing customer.csv 
df_customer = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'), index_col = False)

In [3]:
# Importing ords_prods_aggregated pkl from last exercise 4.8
df_ords_prods_aggregated = pd.read_pickle(os.path.join( path, 'Data', 'Prepared Data', 'orders_products_aggregated.pkl'))

In [5]:
# Check the new df_customer
df_customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
# Check current instacard data
df_ords_prods_aggregated.head()

,order_id,user_id,eval_set,number_of_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,price_range_loc,busiest_day,Busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_prior_order,frequency_flag
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,NaN,Regularly busy,Normal days,Average Orders,10,New Customer,6.367797,Low spender,20.259259,Non-frequent customer
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,NaN,Regularly busy,Slowest days,Average Orders,10,New Customer,6.367797,Low spender,20.259259,Non-frequent customer
2,473747,1,prior,3,3,12,21.0,196,1,1,...,NaN,Regularly busy,Slowest days,Most Orders,10,New Customer,6.367797,Low spender,20.259259,Non-frequent customer
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,NaN,Least busy,Slowest days,Average Orders,10,New Customer,6.367797,Low spender,20.259259,Non-frequent customer
4,431534,1,prior,5,4,15,28.0,196,1,1,...,NaN,Least busy,Slowest days,Most Orders,10,New Customer,6.367797,Low spender,20.259259,Non-frequent customer

In [7]:
# Check the size of new df_customer
df_customer.shape

(206209, 10)

### 4. Data Wrangling of new df_customer

In [9]:
# Generating descriptive analysis of new df_customer
df_customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [63]:
# Check frequency
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int64
 1   first_name            206209 non-null  object
 2   last_name             206209 non-null  object
 3   gender                206209 non-null  object
 4   state                 206209 non-null  object
 5   age                   206209 non-null  int64
 6   date_joined           206209 non-null  object
 7   number_of_dependants  206209 non-null  int64
 8   family_status         206209 non-null  object
 9   income                206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [13]:
# Checking for blanks or NaN
df_customer['Gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: Gender, dtype: int64

In [14]:
# Checking for blanks or NaN
df_customer['STATE'].value_counts(dropna = False)

Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: STATE, dtype: int64

In [15]:
# Checking for blanks or NaN
df_customer['Age'].value_counts(dropna = False)

19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: Age, Length: 64, dtype: int64

In [16]:
# Checking for blanks or NaN
df_customer['n_dependants'].value_counts(dropna = False)

0    51602
3    51594
1    51531
2    51482
Name: n_dependants, dtype: int64

In [17]:
# Checking for blanks or NaN
df_customer['fam_status'].value_counts(dropna = False)

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: fam_status, dtype: int64

In [18]:
# Checking for blanks or NaN
df_customer['income'].value_counts(dropna = False)

57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: income, Length: 108012, dtype: int64

In [55]:
# Renaming several headers 
df_customer.rename(columns = {'Last_name' : 'last_name'}, inplace = True)

In [53]:
df_customer.rename(columns = {'State' : 'state'}, inplace = True)

In [59]:
df_customer.rename(columns = {'Number_of_dependants' : 'number_of_dependants'}, inplace = True)

In [23]:
df_customer.rename(columns = {'fam_status' : 'family_status'}, inplace = True)

In [57]:
df_customer.rename(columns = {'First_name' : 'first_name'}, inplace = True)

In [60]:
df_customer.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [51]:
df_customer.rename(columns = {'Age' : 'age'}, inplace = True)

In [61]:
# Check new header
df_customer.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

#### 5. Complete the fundamental data quality and consistency checks (e.g.check for and address missing values and duplicates, and convert any mixed-type data)

In [32]:
# Checking for mixed-typed data

for col in df_customer.columns.tolist():
  weird = (df_customer[[col]].applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer[weird]) > 0:
    print (col)

First_name

##### Column ´First_name´ contains mixed-type data

In [37]:
# Find NaN value

print(df_customer['First_name'].isna().sum())

11259

In [40]:
# Locate NaN found above

df_customer.loc[df_customer['First_name'].isna()]

,user_id,First_name,Last_name,Gender,State,Age,date_joined,Number_of_dependants,family_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [42]:
# Imputing NaN values with 'Unknown'
df_customer['First_name'].fillna('Unknown', inplace=True)

In [43]:
# Checking again for mixed-typed data

for col in df_customer.columns.tolist():
  weird = (df_customer[[col]].applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer[weird]) > 0:
    print (col)

##### None found now

In [44]:
# Checking for missing values

df_customer.isnull().sum()

user_id                 0
First_name              0
Last_name               0
Gender                  0
State                   0
Age                     0
date_joined             0
Number_of_dependants    0
family_status           0
income                  0
dtype: int64

In [45]:
# Looking for duplicates

df_dups = df_customer[df_customer.duplicated()]

In [46]:
df_dups

Empty DataFrame
Columns: [user_id, First_name, Last_name, Gender, State, Age, date_joined, Number_of_dependants, family_status, income]
Index: []

##### No duplicateds found!

### 6. Combine your customer data with the rest of your prepared Instacart data

#### First export cleaned df_customer under ´Prepared data´ as ´customer_cleaned´

In [67]:
# Export dataframe to the Prepared Data folder
df_customer.to_pickle(os.path.join(path, 'Data','Prepared Data', 'customer_cleaned.pkl'))

In [65]:
# Merge df_customer with prepared Instacart data using user_id as key column

df_ords_prods_customer_merge = df_ords_prods_aggregated.merge(df_customer, on = ['user_id'])

### Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [68]:
#Export to pickle file
df_ords_prods_customer_merge.to_pickle(os.path.join(path, 'Data','Prepared Data', 'ords_prods_customer_merge.pkl'))